benchmark-results/tcp-pool-50conns/pgbench_stdout/proxy_passthrough_readonly_connect_c10_r2.out
pgbench (16.13 (Ubuntu 16.13-0ubuntu0.24.04.1))
transaction type: <builtin: select only>
scaling factor: 10
query mode: simple
number of clients: 10
number of threads: 10
maximum number of tries: 1
duration: 30 s
number of transactions actually processed: 2881
number of failed transactions: 0 (0.000%)
latency average = 104.592 ms
average connection time = 103.964 ms
tps = 95.609744 (including reconnection times)