benchmark-results/tcp-pool-50conns/pgbench_stdout/proxy_pgcat_readonly_connect_c1_r1.out
pgbench (16.13 (Ubuntu 16.13-0ubuntu0.24.04.1))
transaction type: <builtin: select only>
scaling factor: 10
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
duration: 30 s
number of transactions actually processed: 3613
number of failed transactions: 0 (0.000%)
latency average = 8.304 ms
average connection time = 7.917 ms
tps = 120.427581 (including reconnection times)