benchmark-results/tcp-pool-50conns/pgbench_stdout/proxy_pgcat_readonly_connect_c50_r1.out
pgbench (16.13 (Ubuntu 16.13-0ubuntu0.24.04.1))
transaction type: <builtin: select only>
scaling factor: 10
query mode: simple
number of clients: 50
number of threads: 50
maximum number of tries: 1
duration: 30 s
number of transactions actually processed: 11678
number of failed transactions: 0 (0.000%)
latency average = 128.902 ms
average connection time = 124.846 ms
tps = 387.891681 (including reconnection times)