benchmark-results/tcp-pool-50conns/pgbench_stdout/proxy_pgcat_readonly_connect_c50_r2.out
pgbench (16.13 (Ubuntu 16.13-0ubuntu0.24.04.1))
transaction type: <builtin: select only>
scaling factor: 10
query mode: simple
number of clients: 50
number of threads: 50
maximum number of tries: 1
duration: 30 s
number of transactions actually processed: 11322
number of failed transactions: 0 (0.000%)
latency average = 132.743 ms
average connection time = 128.614 ms
tps = 376.668009 (including reconnection times)