benchmark-results/tcp-pool-50conns/pgbench_stdout/proxy_pgcat_readonly_steady_c100_r3.out
pgbench (16.13 (Ubuntu 16.13-0ubuntu0.24.04.1))
transaction type: <builtin: select only>
scaling factor: 10
query mode: simple
number of clients: 100
number of threads: 64
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 5537104
number of failed transactions: 0 (0.000%)
latency average = 1.073 ms
initial connection time = 564.542 ms
tps = 93157.641691 (without initial connection time)