benchmark-results/tcp-pool-50conns/pgbench_stdout/proxy_pool_readonly_connect_c1_r2.out
pgbench (16.13 (Ubuntu 16.13-0ubuntu0.24.04.1))
transaction type: <builtin: select only>
scaling factor: 10
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
duration: 30 s
number of transactions actually processed: 3752
number of failed transactions: 0 (0.000%)
latency average = 7.999 ms
average connection time = 7.685 ms
tps = 125.012965 (including reconnection times)