benchmark-results/tcp-pool-50conns/pgbench_stdout/proxy_pool_readonly_steady_c50_r3.out
pgbench (16.13 (Ubuntu 16.13-0ubuntu0.24.04.1))
transaction type: <builtin: select only>
scaling factor: 10
query mode: simple
number of clients: 50
number of threads: 50
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 3076826
number of failed transactions: 0 (0.000%)
latency average = 0.971 ms
initial connection time = 243.258 ms
tps = 51488.132168 (without initial connection time)