benchmark-results/tcp-pool-50conns/pgbench_stdout/proxy_pool_tpcb_steady_c250_r3.out
pgbench (16.13 (Ubuntu 16.13-0ubuntu0.24.04.1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 10
query mode: simple
number of clients: 250
number of threads: 64
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 517649
number of failed transactions: 0 (0.000%)
latency average = 28.456 ms
initial connection time = 1110.052 ms
tps = 8785.482922 (without initial connection time)